#### CommonSharedAssetType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "CommonSharedAsset" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum CommonSharedAssetType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CommonSharedAssetType ``` |

| Visual C++ |
| --- |
| ``` public enum class CommonSharedAssetType ``` |

# Members

| Member name | Description |
| --- | --- |
| Shared |  |
| Independent |  |

# See Also

Autodesk.Revit.DB.Visual Namespace